# Jupyter notebook sample

In [9]:
import pandas as pd

# Define file paths using raw strings
file_path_yahoo = r'C:\Users\Martin\DataspellProjects\S&P_500_Seasonality_Analysis\data\raw\^SPX.csv'
file_path_investing = r'C:\Users\Martin\DataspellProjects\S&P_500_Seasonality_Analysis\data\raw\S&P 500 Historical Data.csv'

# Load the datasets
df_yahoo = pd.read_csv(file_path_yahoo)  # Data from Yahoo Finance
df_investing = pd.read_csv(file_path_investing)  # Data from Investing.com

# Ensure the date column is in datetime format
# Assuming the date column is named 'Date' in both datasets. Adjust if needed.

df_yahoo['Date'] = pd.to_datetime(df_yahoo['Date'], errors='coerce')
df_investing['Date'] = pd.to_datetime(df_investing['Date'], errors='coerce')

# Sort datasets by date
df_yahoo_sorted = df_yahoo.sort_values(by='Date')
df_investing_sorted = df_investing.sort_values(by='Date')

# Display the first 5 rows from the earliest record
print("First 5 rows of Yahoo Finance dataset (sorted by earliest date):")
display(df_yahoo_sorted.head())

print("\nFirst 5 rows of Investing.com dataset (sorted by earliest date):")
display(df_investing_sorted.head())

First 5 rows of Yahoo Finance dataset (sorted by earliest date):

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-01-01,1111.920044,1155.380005,1105.079956,1131.130005,1131.130005,32820000000
1,2004-02-01,1131.130005,1158.979980,1124.439941,1144.939941,1144.939941,27985600000
2,2004-03-01,1144.939941,1163.229980,1087.160034,1126.209961,1126.209961,33597900000
3,2004-04-01,1126.209961,1150.569946,1107.229980,1107.300049,1107.300049,31611900000
4,2004-05-01,1107.300049,1127.739990,1076.319946,1120.680054,1120.680054,29326400000

First 5 rows of Investing.com dataset (sorted by earliest date):

          Date     Price      Open      High       Low  Vol. Change %
240 2004-01-01  1,131.10  1,111.90  1,155.40  1,105.10   NaN    1.73%
239 2004-02-01  1,144.90  1,131.10  1,159.00  1,124.40   NaN    1.22%
238 2004-03-01  1,126.20  1,144.90  1,163.20  1,087.10   NaN   -1.63%
237 2004-04-01  1,107.30  1,126.20  1,150.60  1,107.20   NaN   -1.68%
236 2004-05-01  1,120.70  1,107.30  1,127.70  1,076.30   NaN    1.21%

In [11]:
import pandas as pd

# Define file paths using raw strings
file_path_yahoo = r'C:\Users\Martin\DataspellProjects\S&P_500_Seasonality_Analysis\data\raw\^SPX.csv'
file_path_investing = r'C:\Users\Martin\DataspellProjects\S&P_500_Seasonality_Analysis\data\raw\S&P 500 Historical Data.csv'

# Load the datasets
df_yahoo = pd.read_csv(file_path_yahoo)  # Data from Yahoo Finance
df_investing = pd.read_csv(file_path_investing)  # Data from Investing.com

# Ensure the date column is in datetime format
df_yahoo['Date'] = pd.to_datetime(df_yahoo['Date'], errors='coerce')
df_investing['Date'] = pd.to_datetime(df_investing['Date'], errors='coerce')

# Sort datasets by date
df_yahoo_sorted = df_yahoo.sort_values(by='Date')
df_investing_sorted = df_investing.sort_values(by='Date')

# Merge the datasets on the 'Date' column
merged_df = pd.merge(df_yahoo_sorted, df_investing_sorted, on='Date', how='inner')

# Display the first few rows of the merged dataset
print("First few rows of the merged dataset:")
display(merged_df.head())

# Display the column names of the merged dataset
print("\nColumn names in the merged dataset:")
print(merged_df.columns.tolist())

First few rows of the merged dataset:

,Date,Open_x,High_x,Low_x,Close,Adj Close,Volume,Price,Open_y,High_y,Low_y,Vol.,Change %
0,2004-01-01,1111.920044,1155.380005,1105.079956,1131.130005,1131.130005,32820000000,"1,131.10","1,111.90","1,155.40","1,105.10",NaN,1.73%
1,2004-02-01,1131.130005,1158.979980,1124.439941,1144.939941,1144.939941,27985600000,"1,144.90","1,131.10","1,159.00","1,124.40",NaN,1.22%
2,2004-03-01,1144.939941,1163.229980,1087.160034,1126.209961,1126.209961,33597900000,"1,126.20","1,144.90","1,163.20","1,087.10",NaN,-1.63%
3,2004-04-01,1126.209961,1150.569946,1107.229980,1107.300049,1107.300049,31611900000,"1,107.30","1,126.20","1,150.60","1,107.20",NaN,-1.68%
4,2004-05-01,1107.300049,1127.739990,1076.319946,1120.680054,1120.680054,29326400000,"1,120.70","1,107.30","1,127.70","1,076.30",NaN,1.21%

Column names in the merged dataset:
['Date', 'Open_x', 'High_x', 'Low_x', 'Close', 'Adj Close', 'Volume', 'Price', 'Open_y', 'High_y', 'Low_y', 'Vol.', 'Change %']

In [25]:


# Resolve column name conflicts
# For columns with suffixes '_x' and '_y', we keep the '_y' columns and rename them to remove the suffix
for col in merged_df.columns:
    if col.endswith('_x'):
        new_col = col.replace('_x', '')
        if new_col in merged_df.columns:
            merged_df[new_col] = merged_df[new_col].combine_first(merged_df[col])
        merged_df.drop(columns=[col], inplace=True)

# Remove columns with all NaN values
merged_df = merged_df.dropna(axis=1, how='all')

# Display the first few rows of the cleaned merged dataset
print("First few rows of the cleaned merged dataset:")
display(merged_df.head())

# Display the column names of the cleaned merged dataset
print("\nColumn names in the cleaned merged dataset:")
print(merged_df.columns.tolist())

First few rows of the cleaned merged dataset:

,Date,Close,Adj Close,Volume,Price,Open_y,High_y,Low_y,Change %
0,2004-01-01,1131.130005,1131.130005,32820000000,"1,131.10","1,111.90","1,155.40","1,105.10",1.73%
1,2004-02-01,1144.939941,1144.939941,27985600000,"1,144.90","1,131.10","1,159.00","1,124.40",1.22%
2,2004-03-01,1126.209961,1126.209961,33597900000,"1,126.20","1,144.90","1,163.20","1,087.10",-1.63%
3,2004-04-01,1107.300049,1107.300049,31611900000,"1,107.30","1,126.20","1,150.60","1,107.20",-1.68%
4,2004-05-01,1120.680054,1120.680054,29326400000,"1,120.70","1,107.30","1,127.70","1,076.30",1.21%

Column names in the cleaned merged dataset:
['Date', 'Close', 'Adj Close', 'Volume', 'Price', 'Open_y', 'High_y', 'Low_y', 'Change %']

In [31]:


def remove_suffix_y_and_drop_columns(df, columns_to_drop):
    # Rename columns by removing the '_y' suffix
    df.columns = [col.replace('_y', '') for col in df.columns]
    
    # Drop specified columns
    df = df.drop(columns=columns_to_drop, errors='ignore')
    
    return df

# Specify columns to drop
columns_to_drop = ['Adj Close']

# Apply the function to the DataFrame
merged_df = remove_suffix_y_and_drop_columns(merged_df, columns_to_drop)

# Display the column names of the cleaned merged dataset after renaming and dropping columns
print("\nColumn names in the cleaned merged dataset after renaming and dropping:")
print(merged_df.columns.tolist())

# Display the first few rows to verify the changes
print("\nFirst few rows of the cleaned merged dataset:")
display(merged_df.head())

Column names in the cleaned merged dataset after renaming and dropping:
['Date', 'Close', 'Volume', 'Price', 'Open', 'High', 'Low', 'Change %']

First few rows of the cleaned merged dataset:

,Date,Close,Volume,Price,Open,High,Low,Change %
0,2004-01-01,1131.130005,32820000000,"1,131.10","1,111.90","1,155.40","1,105.10",1.73%
1,2004-02-01,1144.939941,27985600000,"1,144.90","1,131.10","1,159.00","1,124.40",1.22%
2,2004-03-01,1126.209961,33597900000,"1,126.20","1,144.90","1,163.20","1,087.10",-1.63%
3,2004-04-01,1107.300049,31611900000,"1,107.30","1,126.20","1,150.60","1,107.20",-1.68%
4,2004-05-01,1120.680054,29326400000,"1,120.70","1,107.30","1,127.70","1,076.30",1.21%

In [33]:
import os

# Define the path to the directory and file
processed_dir = r'C:\Users\Martin\DataspellProjects\S&P_500_Seasonality_Analysis\data\processed'
processed_file_path = os.path.join(processed_dir, 'merged_cleaned_data.csv')

# Create the directory if it doesn't exist
os.makedirs(processed_dir, exist_ok=True)

# Save the cleaned DataFrame to a CSV file
merged_df.to_csv(processed_file_path, index=False)

print(f"Processed data saved to {processed_file_path}")

Processed data saved to C:\Users\Martin\DataspellProjects\S&P_500_Seasonality_Analysis\data\processed\merged_cleaned_data.csv